src/test/jmeter/results_post_filters/summary_stress_test_filtered.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET Homepage,45255,1087,1,5454,1713.18,0.000%,125.48107,660.47,17.65,5389.8
GET ChatBot,44960,159,0,4995,790.99,0.000%,124.85802,424.55,18.41,3481.9
GET Mappa,44806,190,0,4894,806.72,0.000%,124.51299,601.03,18.12,4942.9
TOTAL,135021,480,0,5454,1262.45,0.000%,374.38029,1684.06,54.11,4606.2